#python "D:/Python/Дискретная лаба 7 (2).py"
a = [1, 2, 3, 4]
b = [[0,  1,  0,  0,],
     [0,  0,  1,  0,], 
     [1,  0,  0,  0,], 
     [0,  1,  1,  0,],]
print('Матрица смежности второго графа:' + '\n')
print('   {}  {}  {}  {}\n'.format(a[0], a[1], a[2], a[3]))

for i in range(len(a)):
	print('{}  {}  {}  {}  {}\n'.format(a[i], b[i][0], b[i][1],
	                                   b[i][2], b[i][3]))

n = []
for i in range(len(b)):
	for h in range(len(b[i])):
		if b[i][h] == 1:
			n.append(b[i][h])
print('Количество ребер данного графа: ' + str(int(sum(n))))

c = []
for i in range(int(sum(n))):
	c.append(i+1)

d = [ [' 0',' 0',' 0',' 0',' 0'],
      [' 0',' 0',' 0',' 0',' 0'],
      [' 0',' 0',' 0',' 0',' 0'], 
      [' 0',' 0',' 0',' 0',' 0'], ]

d[1][0] = ' 1'
d[0][0] = '-1'

d[1][1] = ' 1'
d[3][1] = '-1'

d[2][2] = ' 1'
d[2][3] = '-1'

d[2][3] = ' 1'
d[3][2] = '-1'

d[0][4] = ' 1'
d[3][4] = '-1'

print('\n')
print('Матрица инцидентности второго графа:')
print('\n')
print('По горизонтали(1-5) - номер ребра, По вертикали(1-4) - номер вершины:')
print('\n')


print('    {}   {}   {}   {}   {}\n'.format(c[0],
                c[1], c[2], c[3], c[4]))

for i in range(len(a)):
	print('{}  {}  {}  {}  {}  {}\n'.format(a[i],
	 d[i][0], d[i][1], d[i][2], d[i][3], d[i][4]))