#python "D:/Python/Дискретная лаба 8 - копия.py"
A = [ 'КарГТУ', 'ТехнБ', 'СГУ', 'МГТУ', 
	'Ауэзова', 'Гоголя', 'Болашак', 'КарГУ' ]
C = {
	'КарГТУ': [ ['ТехнБ', 15], ['Ауэзова', 5], ['СГУ', 25], ['Гоголя', 20] ],
	'ТехнБ': [ ['КарГТУ', 15 ], ['СГУ', 15] ],
	'СГУ': [ ['КарГТУ', 25 ], ['ТехнБ', 15], ['Гоголя', 15],['Болашак', 15], 
											[ 'МГТУ', 25 ], [ 'КарГУ', 25 ] ],
	'МГТУ': [ ['СГУ', 25], ['КарГУ', 20] ],
	'Ауэзова': [ ['КарГТУ', 5], ['Гоголя', 15], ['Болашак', 25] ],
	'Гоголя': [ ['КарГТУ', 20], ['Ауэзова', 15], ['СГУ', 15], ['Болашак', 15] ],
	'Болашак': [ ['КарГУ', 35], ['Ауэзова', 25], ['СГУ', 15], ['Гоголя', 15] ],
	'КарГУ': [ ['МГТУ', 20], ['СГУ', 35], ['Болашак', 35] ]
}

D = []
v = 1
def road():
	B = C
	for t in range(len(C[C[A[0]][0][0]])):
		if B[A[0]][0][0] in B:
			if B[B[A[0]][0][0]][0][0] == B[A[1]][t][0]:
				v = 0
			else:
				D.append(B[A[0]][0][1] + B[A[1]][t][1])

	for t in range(len(C[C[A[0]][0][0]])):
		if B[A[0]][1][0] in B:
			if B[B[A[0]][0][0]][0][0] == B[A[1]][t][0]:
				v = 0
			else:
				D.append(B[A[0]][0][1] + B[A[1]][t][1])

road()
print(D)
print(C[C[A[0]][0][0]][0][0])		
'''if B[A[0]][0][0] in B:			
			D.append(B[A[0]][0][1] + B[A[1]][0][1])'''