#python "D:/Python/Дискретная лаба 8.py"
A = [
	['КарГТУ', 'ТехнБ', 15 ],

	['КарГТУ', 'Ауэзова', 5 ],

	['КарГТУ', 'СГУ', 25 ], 

	['КарГТУ', 'Гоголя', 20 ],

	['ТехнБ', 'СГУ', 15 ],

	['СГУ', 'Гоголя', 15 ],
	
	['СГУ', 'Болашак', 15 ],

	['СГУ', 'МГТУ', 25 ],

	['СГУ', 'КарГУ', 35 ],
	
	['МГТУ', 'КарГУ', 20 ],
	
	['КарГУ', 'Болашак', 35 ],

	['Болашак', 'Гоголя', 15 ],
	
	['Ауэзова', 'Гоголя', 15 ],
	
	['Ауэзова', 'Болашак', 25 ]
]
B = []
n = 0
m = 1
k = 2
'''if A[0][1] in A[1]:
	B.append(A[0][2] + A[1][2])

if A[0][1] in A[2]:
	B.append(A[0][2] + A[2][2])

if A[0][1] in A[4]:
	B.append(A[0][2] + A[4][2])
		
print(B)'''
for i in range(len(A)):
	

	
		
print(B)



'''n = 0
for g in range(len(A)):
	for i in range(len(C[A[g]])):
		if C[A[g]] in C[A[g+1]]:

		n += C[A[g]][i][1]
		print(C[A[g]][i][1])

print(n)'''

